#  Задача «Четные и нечетные».

name = ('нейропрограммирование')
print(name[::2],name[1::2])