#Задача «Равные части».

name =("кенгуру")
print(name[4:]+name[:4])